class MusicData {
    constructor() {
        this.items = [
            '凡心-董真.mp3',
            '鸟语林-双笙.mp3',
            '终于-双笙.mp3',
            '神武醉相思-双笙.mp3',
            '生世守护-双笙.mp3',
            '冰心明-双笙.mp3',
            '司南歌-双笙&肥皂菌.mp3',
        ]
    }
}

class LrcData {
    constructor() {
        this.txt = [['[00:01.03]凡心-(电视剧《天乩之白蛇传说》插曲) - 董真\n' +
            '[00:01.56]作词：周洁颖&董真 \n' +
            '[00:02.15]作曲：林华勇 \n' +
            '[00:02.69]编曲：杨川云 \n' +
            '[00:03.11]混音：付威 \n' +
            '[00:03.90]制作人：谭旋\n' +
            '[00:04.71]出品：上海谭旋音乐工作室\n' +
            '[00:28.64]落红飘入尘土\n' +
            '[00:35.30]相思成疾成缚\n' +
            '[00:41.76]缘分藏根入骨\n' +
            '[00:44.76]纠缠着脚下的路\n' +
            '[00:48.62]一步步近在远赴\n' +
            '[00:56.00]叹花为你复苏\n' +
            '[01:02.95]过往历历在目\n' +
            '[01:08.94]有情难为眷属\n' +
            '[01:12.40]疑问在心中反复\n' +
            '[01:16.49]究竟情为何物\n' +
            '[01:22.21]一夜的思念挨不到繁花盛开\n' +
            '[01:29.10]你转身坠落凡尘  云游四海\n' +
            '[01:35.89]千年如尘埃  换来你一世  相守的等待\n' +
            '[01:43.63]天地不灭  痴心不改\n' +
            '[02:04.49]仙凡一念之间\n' +
            '[02:11.65]不过破茧成蝶\n' +
            '[02:17.62]多少生离死别\n' +
            '[02:21.12]究竟是飞升的劫\n' +
            '[02:25.30]还是情深缘浅\n' +
            '[02:30.94]你和我逃不脱冥冥中的安排\n' +
            '[02:37.82]又怎么能抵挡这春心澎湃\n' +
            '[02:44.67]只愿你不问前尘只恋今生拥我入怀\n' +
            '[02:52.34]天地不灭  初心不改\n' +
            '[03:15.42]一夜的思念挨不到繁花盛开\n' +
            '[03:22.40]你转身坠落凡尘  云游四海\n' +
            '[03:29.23]千年如尘埃  换来你一世  相守的等待\n' +
            '[03:37.23]天地不灭  初心不改\n' +
            '[03:43.82]天地不灭  初心不改\n' +
            '[03:54.06]\n'],

            ['[00:00.20]鸟语林 - 双笙\n' +
            '[00:00.44]词：刘畅\n' +
            '[00:00.66]曲：单喻龙\n' +
            '[00:00.83]编曲：单喻龙\n' +
            '[00:00.99]制作：谭旋\n' +
            '[00:01.14]吉他Guitarist：赵勤\n' +
            '[00:01.30]笛子Flute Player：囚牛\n' +
            '[00:01.44]古筝Chinese Ziter Player：丁雪儿\n' +
            '[00:01.60]弦乐Strings：国际首席爱乐乐团\n' +
            '[00:01.75]和声Background Vocalist：双笙\n' +
            '[00:01.91]录音工程师Recording Engineer：谭旋\n' +
            '[00:02.08]混音工程师Mixing Engineer：Keizo\n' +
            '[00:02.24]制作发行Produce Company：上海希瓜音乐制作有限公司\n' +
            '[00:26.84]花开在了岁晏\n' +
            '[00:29.66]你不忍更惹遥夜\n' +
            '[00:34.56]于是我心无杂念\n' +
            '[00:39.27]去九天上揽月\n' +
            '[00:42.42]入红尘谈笑过眼\n' +
            '[00:47.12]只为了心中的天\n' +
            '[00:52.68]将捂热的手揣入红尘里\n' +
            '[00:59.06]将取暖的衣裁得合体\n' +
            '[01:05.33]将清淡的米一粒粒煮成蜜语\n' +
            '[01:12.39]将你我写进天意\n' +
            '[01:17.23]每当藏身在你的世界\n' +
            '[01:23.52]半枕炊烟压云眠 入琼苑\n' +
            '[01:29.78]你眉眼中的桃花源 莺莺燕燕\n' +
            '[01:36.90]不闻窗外几多风刀霜剑\n' +
            '[01:43.28]这芳时 似人间\n' +
            '[02:14.06]花开在了岁晏\n' +
            '[02:17.14]你不忍更惹遥夜\n' +
            '[02:21.84]于是我心无杂念\n' +
            '[02:26.60]去九天上揽月\n' +
            '[02:29.67]入红尘谈笑过眼\n' +
            '[02:34.47]只为了心中的天\n' +
            '[02:39.99]让漂浮的心更贴近地面\n' +
            '[02:46.33]让紧握的拳挥向黑夜\n' +
            '[02:52.77]让难过的劫一步步渡成良缘\n' +
            '[02:59.74]让今生命运相衔\n' +
            '[03:04.55]每当藏身在你的世界\n' +
            '[03:10.97]半枕炊烟压云眠 入琼苑\n' +
            '[03:17.23]你眉眼中的桃花源 莺莺燕燕\n' +
            '[03:24.22]不闻窗外几多风刀霜剑\n' +
            '[03:29.81]一炷香火 生世共婵娟\n' +
            '[03:36.12]一杯粗茶 余香绕长生结\n' +
            '[03:42.49]在比翼的岁岁年年为你春天\n' +
            '[03:49.43]做这芸芸众生中的一泉\n' +
            '[03:55.96]让心涧 注梦田\n' +
            '[04:03.49]\n'],
            ['[00:00.00]终于 - 双笙\n' +
            '[00:01.91]（电视剧《两世欢》片头主题曲）\n' +
            '[00:02.34]作词：张赢\n' +
            '[00:02.79]作曲：罗锟\n' +
            '[00:03.10]编曲：廖正星\n' +
            '[00:03.50]制作人：顾潇予\n' +
            '[00:03.91]音乐监制：宋鹏飞\n' +
            '[00:04.24]音乐统筹：张楠\n' +
            '[00:04.62]弦乐：中国国际爱乐乐团\n' +
            '[00:04.98]大提琴：张平\n' +
            '[00:05.41]吉他：廖正星\n' +
            '[00:05.81]长笛：程晓华\n' +
            '[00:06.17]和声：郭亚楠\n' +
            '[00:06.57]人声录音棚：听见时代Studio\n' +
            '[00:06.89]混音：顾潇予\n' +
            '[00:07.29]母带处理：顾潇予\n' +
            '[00:07.70]音乐出品制作发行：北京听见时代娱乐传媒有限公司\n' +
            '[00:15.18]流年低声轻轻说一段温柔的唇语\n' +
            '[00:21.85]光阴辗转梦里编织着动人的秘密\n' +
            '[00:28.51]梦中的涟漪穿梭在心里\n' +
            '[00:31.72]陪我颠沛流离风浪起\n' +
            '[00:35.16]飘摇无依蜿蜒几里\n' +
            '[00:38.42]留下斑驳的痕迹\n' +
            '[00:41.79]终于以约为期让我在今夕遇见你\n' +
            '[00:48.39]拨乱宿命几世等待一段缘起\n' +
            '[00:54.32]眼中天地是我背负的荆棘\n' +
            '[01:01.17]最想却是和你再相聚\n' +
            '[01:23.75]两世凡尘如你只为我抵挡这风雨\n' +
            '[01:30.22]也曾是你和我分享触动人的憧憬\n' +
            '[01:36.69]眉目间沉溺绾几许亲密\n' +
            '[01:40.01]心火摇曳在彼此眼里\n' +
            '[01:43.46]成为知己山海约定\n' +
            '[01:46.70]愿为此情去追寻\n' +
            '[01:50.06]终于是你唤醒勇气常驻在我心里\n' +
            '[01:56.82]就算隔世一言为定不分不离\n' +
            '[02:02.89]不再畏惧命运送我的荆棘\n' +
            '[02:09.53]破茧成蝶飞舞在天地\n' +
            '[02:16.87]终于我能为你成为这更好的自己\n' +
            '[02:23.19]褪去繁华找回最初真心不渝\n' +
            '[02:29.25]一路崎岖是我无悔的经历\n' +
            '[02:36.18]哪怕有天记忆被抹去\n' +
            '[02:43.41]终于漂泊好久的船停靠在你怀里\n' +
            '[02:50.09]依然还会给我海阔天空的勇气\n' +
            '[02:56.23]当分离终有一天再相聚\n' +
            '[03:02.97]我的心还守在你这里\n' +
            '[03:09.67]'],
            ['[00:00.57]神武醉相思 - 双笙\n' +
            '[00:01.85]词：多益网络\n' +
            '[00:02.98]曲：小旭音乐\n' +
            '[00:25.77]夜色微凉君独尝多情伤\n' +
            '[00:31.98]天涯各一方烛红剪西窗\n' +
            '[00:38.33]晓露如霜青河镇风铃响\n' +
            '[00:43.46]神武情花开共君享对影亦成双\n' +
            '[00:50.00]莫笑少年狂只叹缘未央\n' +
            '[00:57.31]纵枫红千里步他乡\n' +
            '[01:02.37]梦中佳人守望\n' +
            '[01:06.32]情刻在心上\n' +
            '[01:08.71]一笑倾城百里香\n' +
            '[01:12.64]翩翩舞霓裳\n' +
            '[01:15.01]一目山水长\n' +
            '[01:18.97]只影踏秋殇\n' +
            '[01:21.29]三千繁华难阻挡\n' +
            '[01:25.25]应君诺怎能相忘\n' +
            '[01:57.50]红袖添香再挑灯抿红妆\n' +
            '[02:03.55]素手拾月光天涯两相望\n' +
            '[02:09.91]明眸泪光临仙镇轻声唱\n' +
            '[02:15.03]雁南飞年年影成双带走你模样\n' +
            '[02:21.52]思念随风漾红尘人未葬\n' +
            '[02:28.90]怎甘心年华似流光\n' +
            '[02:33.98]梦中佳人守望\n' +
            '[02:37.92]情刻在心上\n' +
            '[02:40.30]一笑倾城百里香\n' +
            '[02:44.19]翩翩舞霓裳\n' +
            '[02:46.63]一目山水长\n' +
            '[02:50.51]只影踏秋殇\n' +
            '[02:52.93]相识相知相守望\n' +
            '[02:56.89]白首共花黄\n' +
            '[02:59.22]万水千山难挡\n' +
            '[03:03.18]梦觉在他乡\n' +
            '[03:05.58]两情相悦自成双\n' +
            '[03:09.50]素手织霓裳\n' +
            '[03:11.86]月下红颜妆\n' +
            '[03:15.77]却为作嫁忙\n' +
            '[03:18.16]神武天地满城芳\n' +
            '[03:22.07]承君诺怎敢相忘'],
            ['[00:00.86]生世守护 - 双笙\n' +
            '[00:01.16]作词：刘凤瑶\n' +
            '[00:01.38]作曲：刘凤瑶\n' +
            '[00:01.55]编曲：韦吉兴\n' +
            '[00:01.70]制作人：刘凤瑶\n' +
            '[00:01.85]弦乐：国际首席爱乐乐团\n' +
            '[00:02.02]和声：刘凤瑶\n' +
            '[00:02.18]录音：张栋@好听音乐\n' +
            '[00:02.34]混音：蒋柽@芬响家 FINN MUSIC\n' +
            '[00:02.50]Master：蒋柽@芬响家 FINN MUSIC\n' +
            '[00:02.67]制作STUDIO：芬响家 FINN MUSIC\n' +
            '[00:02.86]音乐统筹：张子豪\n' +
            '[00:03.11]出品人：何倩\n' +
            '[00:03.36]出品公司：仁溪音乐\n' +
            '[00:16.97]从此定格在这一刻\n' +
            '[00:18.91]忘了世间天地喜怒生万物\n' +
            '[00:25.08]呼风唤雨拨云散雾\n' +
            '[00:27.14]千年过度终只等的一个人\n' +
            '[00:33.41]留不住的铭心刻骨\n' +
            '[00:35.41]握在心底里依旧清清楚楚\n' +
            '[00:41.81]来之顽固去之沉浮\n' +
            '[00:43.74]愿能赐我一生一世的守护\n' +
            '[00:49.60]那一天\n' +
            '[00:52.59]雪花漫天飞舞\n' +
            '[00:58.27]我等的那个他\n' +
            '[01:01.02]出现在花雾\n' +
            '[01:06.15]那一天\n' +
            '[01:09.29]时间从此陌路\n' +
            '[01:14.80]来不及去落幕\n' +
            '[01:18.56]消失在深处\n' +
            '[01:40.35]留不住的铭心刻骨\n' +
            '[01:42.30]握在心底里依旧清清楚楚\n' +
            '[01:48.61]来之顽固去之沉浮\n' +
            '[01:50.50]愿能赐我一生一世的守护\n' +
            '[01:56.50]那一天\n' +
            '[01:59.41]雪花漫天飞舞\n' +
            '[02:05.27]我等的那个他\n' +
            '[02:07.89]出现在花雾\n' +
            '[02:12.99]那一天\n' +
            '[02:16.18]时间从此陌路\n' +
            '[02:21.79]来不及去落幕\n' +
            '[02:24.67]消失在深处\n' +
            '[02:29.86]那一天\n' +
            '[02:32.99]时间从此陌路\n' +
            '[02:38.67]来不及去落幕\n' +
            '[02:41.79]消失在深处\n' +
            '[02:49.31]\n'],
            ['[00:00.47]冰心明 - 双笙\n' +
            '[00:00.69]词：安之/天天\n' +
            '[00:00.94]曲：Mil\n' +
            '[00:05.75]夜空闪动几颗流星\n' +
            '[00:09.18]谁在许愿你听\n' +
            '[00:12.94]遥望前方灯火通明\n' +
            '[00:16.62]谁在吟唱\n' +
            '[00:18.21]用情\n' +
            '[00:19.35]风声绕过月色沉静\n' +
            '[00:23.09]罗扇飞舞\n' +
            '[00:24.88]青衣穿行\n' +
            '[00:31.45]虫儿鸣\n' +
            '[00:33.27]云轻盈\n' +
            '[00:35.02]百花深处 有药香未名\n' +
            '[00:38.74]笑语声 像银铃\n' +
            '[00:42.42]微笑融化坚冰\n' +
            '[00:45.23]远山入景\n' +
            '[00:47.14]天幕湛青\n' +
            '[00:48.88]花开轮回\n' +
            '[00:50.75]不负初心\n' +
            '[00:55.43]湖光山色谁的倒影\n' +
            '[00:59.05]画面开始温馨\n' +
            '[01:02.70]暖风带来花开声音\n' +
            '[01:06.45]美的好像梦境\n' +
            '[01:09.19]初入大荒\n' +
            '[01:11.06]目光坚定\n' +
            '[01:12.88]悬壶济世\n' +
            '[01:14.74]心清神明\n' +
            '[01:18.35]天下太平\n' +
            '[01:34.19]虫儿鸣 云轻盈\n' +
            '[01:37.74]百花深处有药香未名\n' +
            '[01:41.43]笑语声 像银铃\n' +
            '[01:45.28]微笑融化坚冰\n' +
            '[01:47.98]远山入景 天幕湛青\n' +
            '[01:51.58]花开轮回 不念曾经\n' +
            '[01:57.14]长路同行\n' +
            '[02:01.87]夜空闪动几颗流星\n' +
            '[02:05.47]谁在许愿 你听\n' +
            '[02:09.24]遥望前方灯火通明\n' +
            '[02:12.94]谁在吟唱 用情\n' +
            '[02:15.75]身若此柔\n' +
            '[02:17.58]春满杏林\n' +
            '[02:19.34]妙手仁心\n' +
            '[02:21.22]苍生已命\n' +
            '[02:25.90]湖光山色谁的倒影\n' +
            '[02:29.50]画面开始温馨\n' +
            '[02:33.39]暖风带来春的消息\n' +
            '[02:36.95]美的好像梦境\n' +
            '[02:39.61]初入大荒\n' +
            '[02:41.53]目光坚定\n' +
            '[02:43.35]悬壶济世\n' +
            '[02:45.17]心清神明\n' +
            '[02:48.92]天放晴\n' +
            '[02:56.75]冰心明\n' +
            '[03:03.96]伴你行'],
            ['[00:00.07]双笙、肥皂菌·珉珉的猫咪 - 司南歌\n' +
            '[00:02.03]作词：猛虎蔷薇（墨明棋妙）\n' +
            '[00:03.70]作曲：宫寻\n' +
            '[00:04.35]编曲：宫寻\n' +
            '[00:31.17]银封雪原 墨染青川\n' +
            '[00:37.53]奔霄共骑长路短\n' +
            '[00:44.25]灯红邺北 水绿江南\n' +
            '[00:50.97]只影瘦 旧巷宽\n' +
            '[00:56.57]小帆遥渡我生死歧路 几段\n' +
            '[01:03.63]怀抱融尽我苦痛辛酸\n' +
            '[01:10.09]甘为挡刀吞剑\n' +
            '[01:14.88]呕心沥胆\n' +
            '[01:17.51]举身赴难也无怨\n' +
            '[01:21.56]却奈何 相聚太短\n' +
            '[01:23.53]半阙离歌长嗟叹\n' +
            '[01:26.96]回首又见刀光寒\n' +
            '[01:30.36]满腔热血不冷\n' +
            '[01:32.88]兵甲未敛 威镇河山\n' +
            '[01:37.08]念君常为我司南\n' +
            '[01:40.42]为君守得天下安\n' +
            '[01:44.34]再看 一树桃花又烂漫\n' +
            '[01:48.44]岁月深处 为你开遍\n' +
            '[02:19.17]月有圆缺 人有聚散\n' +
            '[02:25.68]双壁合冰心一片\n' +
            '[02:32.44]浮生若梦 长夜望断\n' +
            '[02:39.29]待七夕渡星汉\n' +
            '[02:44.71]此去愿为你弓马再战 几番\n' +
            '[02:51.48]承志不负你家国牵绊\n' +
            '[02:58.24]甘为挡刀吞剑\n' +
            '[03:02.94]呕心沥胆\n' +
            '[03:05.69]举身赴难也无怨\n' +
            '[03:08.67]却奈何 相聚太短\n' +
            '[03:11.75]半阙离歌常嗟叹\n' +
            '[03:15.12]回首犹见刀光寒\n' +
            '[03:18.86]满腔热血不冷\n' +
            '[03:21.03]兵甲未敛 威镇河山\n' +
            '[03:25.27]念君常为我司南\n' +
            '[03:28.60]为君守得天下安\n' +
            '[03:32.30]再看 一树桃花又烂漫\n' +
            '[03:36.34]岁月深处 为你开遍\n' +
            '[03:52.87]半阙离歌常嗟叹\n' +
            '[03:55.65]回首犹见刀光寒\n' +
            '[03:59.08]满腔热血不冷\n' +
            '[04:01.56]兵甲未敛 威镇河山\n' +
            '[04:05.80]念君常为我司南\n' +
            '[04:09.51]为君\n' +
            '[04:10.07]愿君\n' +
            '[04:10.37]守得天下安\n' +
            '[04:13.04]归去来 和这曲相见欢']
        ]

    }
}
